<a href="https://colab.research.google.com/github/SeethalekshmiMohan/Datascience/blob/main/Copy_of_StudentCopy_CO1_Programs_to_handle_data_using_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#1. Write a python program to implement List-to-Series Conversion
import pandas as pd
list=['Seetha','Bhagya','Haritha']
l1=pd.Series(list)
print(l1)

0     Seetha
1     Bhagya
2    Haritha
dtype: object

In [ ]:
#2. Write a python program to Generate the series of dates from 1st September, 2023 to 25th September, 2023 (both inclusive).
import pandas as pd
data=pd.Series(pd.date_range("2023-09-01","2023-09-25",freq="D"))
data

0    2023-09-01
1    2023-09-02
2    2023-09-03
3    2023-09-04
4    2023-09-05
5    2023-09-06
6    2023-09-07
7    2023-09-08
8    2023-09-09
9    2023-09-10
10   2023-09-11
11   2023-09-12
12   2023-09-13
13   2023-09-14
14   2023-09-15
15   2023-09-16
16   2023-09-17
17   2023-09-18
18   2023-09-19
19   2023-09-20
20   2023-09-21
21   2023-09-22
22   2023-09-23
23   2023-09-24
24   2023-09-25
dtype: datetime64[ns]

In [ ]:
"""
3. Given a dictionary, convert it into corresponding dataframe and display it.

"""
import pandas as pd
details={
    "name":["seetha","haritha","bhagya","dethan","adarsh","vishnu","rohit","jissmon","glodin"],
    "age" :[1,2,3,4,5,6,7,8,9]

}
df=pd.DataFrame(details)
print(df)

      name  age
0   seetha    1
1  haritha    2
2   bhagya    3
3   dethan    4
4   adarsh    5
5   vishnu    6
6    rohit    7
7  jissmon    8
8   glodin    9

In [ ]:
"""
4. Given a dataframe, select first 2 rows and output them.

"""
import pandas as pd
details={
    "name":["seetha","haritha","bhagya","dethan","adarsh","vishnu","rohit","jissmon","glodin"],
    "age" :[1,2,3,4,5,6,7,8,9]

}
df=pd.DataFrame(details)
print(df[:2])

      name  age
0   seetha    1
1  haritha    2

In [ ]:
# 5. Given is a dataframe showing name, occupation,salary of people. Find the average salary per occupation.
import pandas as pd
details={
    "names":["seetha","haritha","bhagya","dethan","adarsh","vishnu","rohit","jissmon","glodin"],
    "occupation":["manager","bussiness","teacher","assistant","manager","bussiness","teacher","assistant","manager"],
    "salary":[3000,3500,4000,2500,4500,5000,4300,5700,5000]
}
df=pd.DataFrame(details)
print(df)
occ=df.groupby("occupation")["salary"].mean()
print(occ)

     names occupation  salary
0   seetha    manager    3000
1  haritha  bussiness    3500
2   bhagya    teacher    4000
3   dethan  assistant    2500
4   adarsh    manager    4500
5   vishnu  bussiness    5000
6    rohit    teacher    4300
7  jissmon  assistant    5700
8   glodin    manager    5000
occupation
assistant    4100.000000
bussiness    4250.000000
manager      4166.666667
teacher      4150.000000
Name: salary, dtype: float64